return {
	-- This is what powers LazyVim's fancy-looking
	-- tabs, which include filetype icons and close buttons.
	{
		"akinsho/bufferline.nvim",
		event = "VeryLazy",
		keys = {
			{ "<leader>bp", "<Cmd>BufferLineTogglePin<CR>", desc = "Toggle pin" },
			{ "<leader>bP", "<Cmd>BufferLineGroupClose ungrouped<CR>", desc = "Delete non-pinned buffers" },
			{ "<leader>bo", "<Cmd>BufferLineCloseOthers<CR>", desc = "Delete other buffers" },
			{ "<leader>br", "<Cmd>BufferLineCloseRight<CR>", desc = "Delete buffers to the right" },
			{ "<leader>bl", "<Cmd>BufferLineCloseLeft<CR>", desc = "Delete buffers to the left" },
			{ "<S-h>", "<cmd>BufferLineCyclePrev<cr>", desc = "Prev buffer" },
			{ "<S-l>", "<cmd>BufferLineCycleNext<cr>", desc = "Next buffer" },
			{ "[b", "<cmd>BufferLineCyclePrev<cr>", desc = "Prev buffer" },
			{ "]b", "<cmd>BufferLineCycleNext<cr>", desc = "Next buffer" },
		},
		opts = {
			options = {
        -- stylua: ignore
        close_command = function(n) require("mini.bufremove").delete(n, false) end,
        -- stylua: ignore
        right_mouse_command = function(n) require("mini.bufremove").delete(n, false) end,
				diagnostics = "nvim_lsp",
				always_show_bufferline = false,
				diagnostics_indicator = function(_, _, diag)
					local icons = require("lazyvim.config").icons.diagnostics
					local ret = (diag.error and icons.Error .. diag.error .. " " or "")
						.. (diag.warning and icons.Warn .. diag.warning or "")
					return vim.trim(ret)
				end,
				offsets = {
					{
						filetype = "neo-tree",
						text = "Neo-tree",
						highlight = "Directory",
						text_align = "left",
					},
				},
			},
		},
		config = function(_, opts)
			require("bufferline").setup(opts)
			-- Fix bufferline when restoring a session
			vim.api.nvim_create_autocmd("BufAdd", {
				callback = function()
					vim.schedule(function()
						pcall(nvim_bufferline)
					end)
				end,
			})
		end,
	},

	-- Displays a popup with possible key bindings of the command you started typing
	{
		"folke/which-key.nvim",
		opts = function(_, opts)
			if require("lazyvim.util").has("noice.nvim") then
				opts.defaults["<leader>sn"] = { name = "+noice" }
			end
		end,
	},

	{
		"nvimdev/dashboard-nvim",
		event = "VimEnter",
		opts = function()
			-- local logo = [[
			--         ██╗      █████╗ ███████╗██╗   ██╗██╗   ██╗██╗███╗   ███╗          Z
			--         ██║     ██╔══██╗╚══███╔╝╚██╗ ██╔╝██║   ██║██║████╗ ████║      Z
			--         ██║     ███████║  ███╔╝  ╚████╔╝ ██║   ██║██║██╔████╔██║   z
			--         ██║     ██╔══██║ ███╔╝    ╚██╔╝  ╚██╗ ██╔╝██║██║╚██╔╝██║ z
			--         ███████╗██║  ██║███████╗   ██║    ╚████╔╝ ██║██║ ╚═╝ ██║
			--         ╚══════╝╚═╝  ╚═╝╚══════╝   ╚═╝     ╚═══╝  ╚═╝╚═╝     ╚═╝
			--    ]]
			-- local logo = [[
			--                                                #
			--                                    ####       #+
			--                            ####++++++++++###++#
			--                        ##-+#++++++++++++++++###
			--                #######++++++++++++++++++++++++++#
			--                  ##-++++++++++++++++++++++++++++++#
			--                  ##-++++++++++++++++++++++++++++++++##
			--                ##--++-++++++++++++++++++++++++++++++##
			--                #--++--++++++++++++. -++++++++++++++++##
			--                #+-++++++++##++++++-  .#+++++++++++++#++#
			--                #-+++++++++##++++++   .-#++++++++++++#++#
			--                #-+++++++  ##+++++#      +++++#++++++#++#
			--              #--++++#    .+++++++  .-+-..#++#++++++#++#
			--              #+-+++.#####.+-.++++.-+########++++++#++##
			--              #+++++# ##.-#-+ .+++- ++  -#--++++++#+++#
			--              #++++-...+.++-    .++ .--+++-.++++#+++++#
			--              #+++++    +++        ..-+++  #-##++++##++#
			--              ##+#+++   .-.--   .-....-.     ++++++###+#
			--                #+#++-+-.. .  ....       +   #+++++++#  ##
			--                ###+++.-.....             -  +++#+++++##
			--              ## #++++-.-+###    .++++   +-+#++#+++++++##
			--                  #+++++...   -+++-       ####++#+++++++++#
			--                #++++++++  .- +++++   .. .-+####+#+++++++++
			--              ##++++++#     - .+.         +#####+#++++++++
			--    ]]
			-- local logo = [[
			--                ⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡾⠀⠀⠀⠀⠀⠈⢧⠹⡀⠀⠀⠸⡇⠀⠀⢸⠃⠀⠉⢳⡘⢭⠇⠀⣠⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
			--                ⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠘⣆⢳⣀⣀⣀⣇⣀⣀⣼⣀⡀⠀⠈⣧⠾⣷⡋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
			--                ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠏⠀⠀⢀⣀⣤⡴⣖⣲⣋⣯⣭⣿⣷⣾⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
			--                ⠀⠀⠀⠀⠀⠀⠀⠀⢠⣏⣤⠴⢚⣫⣥⣶⣾⣿⣿⡿⡿⠛⠛⠛⠛⠛⠛⢛⠛⠻⠿⢿⣿⣿⣿⣿⣿⣿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀
			--                ⠀⠀⠀⠀⠀⠀⢀⣴⢟⣩⣴⣾⡿⠿⠛⠉⠉⢸⠋⢆⢻⠀⠀⠀⠀⠀⢀⠘⡆⠀⠀⠀⠈⠉⠙⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀
			--                ⢀⣀⣠⣤⠀⣟⣿⣾⣿⠟⠋⢩⠀⠀⠀⠀⢀⣏⡠⠼⣿⣧⠀⠀⠐⠀⠘⡄⢳⠖⠲⢤⣀⠀⠀⠈⢻⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀
			--                ⣉⠝⢋⣽⣦⣿⡟⠉⠀⠀⠀⡞⠀⠀⠀⣴⡿⠁⠀⠀⠘⢿⣆⠀⠀⠀⠀⣇⠘⣷⡀⠀⠉⠁⠀⢦⠀⠹⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀
			--                ⣡⣾⡿⠛⢹⣿⠃⠀⠀⢀⢰⡇⠀⠀⠀⡼⠁⠀⠀⠀⠀⠈⢿⡄⠀⠀⠀⢸⡄⢻⠙⣄⠀⠀⠀⠈⢇⠀⠹⣿⣿⣿⣿⣏⠳⡄⠀⠀⠀⠀
			--                ⣿⡏⠀⠀⣸⢸⠀⠀⠀⠈⢨⡇⠀⠀⡼⠁⠀⠀⠀⠀⠀⠀⠈⢿⡄⠀⠀⠀⡿⡬⡇⠈⢳⡀⠀⠀⢸⡄⠀⢹⣿⣿⣿⣿⢿⠃⠀⠀⠀⠀
			--                ⣿⡇⠀⠀⢸⢸⠀⠀⠀⠀⢸⠃⣠⠞⠀⠀⠀⣀⣠⣤⡤⣄⣀⠀⠻⣆⠀⠀⣇⢘⣿⣤⣄⣹⣤⠀⠀⣧⠀⠀⢿⣿⣯⣼⣿⠀⠀⠀⠀⠀
			--                ⠹⡇⠀⠀⢸⡄⠀⠀⠀⠀⢸⣟⠁⠀⣶⣴⣾⣿⣿⣿⣿⣶⣤⡀⠀⠈⢧⠀⢸⣀⣼⣿⣿⣏⠻⣧⣀⢹⡆⠀⢸⡟⠀⠀⢿⣦⠀⠀⠀⠀
			--                ⠀⣿⠀⠀⠈⣷⡆⠀⠀⠀⣸⣤⣿⠟⠋⠀⣿⣿⠋⢻⡿⢷⠀⠀⠀⠀⠀⠳⣈⣇⢸⡇⢸⣿⡄⣿⣧⣸⣿⡄⠈⡇⠀⠀⣼⣿⣆⠀⠀⠀
			--                ⠀⢸⡇⠀⢀⠀⢧⠀⠀⠀⠹⡟⠳⠀⠀⠀⢻⣿⠴⠾⠣⣿⠀⠀⠀⠀⠀⠀⠙⢿⡌⢿⣶⡿⢁⡘⣿⣿⣿⣷⠀⡇⠀⠀⣿⣿⣿⡆⠀⠀
			--                ⠀⠀⣿⡇⠐⠀⠘⣆⠀⠀⠀⢳⡀⠀⣄⡀⠀⠙⠒⡖⠚⠃⠀⠀⠀⠀⠀⠀⠀⠀⠙⠤⠬⠄⠘⠃⠹⣿⣿⣿⣿⠇⠀⢀⣿⣿⣿⣿⡀⠀
			--                ⠀⢰⣯⢷⡀⠀⠀⠹⣄⠀⠀⠀⠙⢦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠃⠀⠀⠀⠀⠀⢻⣿⣿⡟⠀⠀⢸⣿⣿⣿⣿⡇⠀
			--                ⠀⣾⠁⠀⢳⡀⠀⠀⢻⣦⠀⠰⡶⠤⢽⣦⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⠙⡇⠀⠀⠈⣿⣿⣿⣿⡗⠀
			--                ⢀⡇⣄⠀⠀⣽⣄⠀⠈⣿⣿⢦⣱⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡏⢀⡿⡄⠀⠀⠘⠛⠛⠋⠀⠀
			--                ⣸⣿⣮⣝⠒⡇⡾⠳⣄⠸⣿⠀⠈⠉⠀⠀⢀⣤⣤⣄⠀⠀⠀⠀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⡇⣸⠁⠘⣆⠀⠀⠀⠀⠀⠀⠀
			--                ⣿⣿⠙⠿⢿⡇⡇⠀⠀⡿⢻⣧⡀⠀⣴⣶⣦⡉⢿⡁⠙⠢⡀⠘⣿⠟⢆⠀⠀⠀⠀⠀⠀⠀⢀⡴⠙⣿⠟⠁⠀⠀⠈⢣⡀⠀⠀⠀⠀⠀
			--                ⣿⡿⠀⠀⢸⣿⡇⠀⠀⢹⠀⣿⣿⡆⢿⣿⡁⠙⢦⡙⢆⠀⠈⠢⡘⡄⠈⢢⠀⠀⠀⠀⠀⣠⠊⠀⠀⠸⡄⠀⠀⠀⠀⠀⠳⡄⠀⠀⠀⠀
			--                ⣿⡇⠀⠀⢸⢠⡇⠀⠀⢸⠀⣻⠹⡇⠘⡇⠑⣄⠀⠉⠢⣵⡄⠀⠘⢿⡄⠀⢣⠀⠀⣠⠞⠁⠀⠀⠀⠀⢹⡀⠀⠀⠀⠀⠀⠹⡄⠀⠀⠀
			--                ⣿⠃⠀⠀⢸⢸⠀⠀⠀⠘⡇⢹⠀⡇⠀⠘⣤⣬⡳⣖⠲⡿⠻⡄⠀⠀⢣⠀⠈⣷⣾⣿⡇⠀⠀⠀⠀⠀⠀⢣⠀⠀⠰⡄⠀⠀⠹⡄⠀⠀
			--                ⣿⠀⠀⠀⢸⢸⠀⠀⠀⠀⣇⠸⡟⠋⠓⠒⠻⣄⢹⠛⢶⠃⠐⠛⠀⠀⠀⠀⠀⠘⣿⣿⣇⠀⠀⠀⠀⠀⠀⠈⣇⠀⠀⢳⡀⠀⠀⠹⡀⠀
			--                ⡇⠀⠀⠀⢸⢸⠀⠀⠀⠀⢹⠀⡇⠀⠀⠀⠀⠘⣿⣄⠈⠂⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣿⠀⠀⠀⠀⠀⠀⠀⠘⣆⠀⠈⣧⠀⠀⠀⢱⠀
			--                ⠃⠀⠀⠀⠸⣿⡆⠀⠀⠀⠘⡇⢹⣤⣀⡀⠀⠀⢹⡜⢣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣇⠀⠀⠀⠀⠀⠀⠀⢹⣆⠀⢹⡆⠀⠀⠀⢧
			--                ⠀⠀⠀⣀⣴⣿⡇⠀⣇⠀⠀⠀⠘⣿⣿⣿⣿⣶⣤⣷⣄⡱⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣄⡀⠀⠀⠀⠀⠀⠀⢿⡄⠘⣷⠀⠀⠀⠘
			--                ██╗  ██╗██╗   ██╗    ████████╗ █████╗  ██████╗ ██╗
			--                ██║  ██║██║   ██║    ╚══██╔══╝██╔══██╗██╔═══██╗██║
			--                ███████║██║   ██║       ██║   ███████║██║   ██║██║
			--                ██╔══██║██║   ██║       ██║   ██╔══██║██║   ██║╚═╝
			--                ██║  ██║╚██████╔╝       ██║   ██║  ██║╚██████╔╝██╗
			--                ╚═╝  ╚═╝ ╚═════╝        ╚═╝   ╚═╝  ╚═╝ ╚═════╝ ╚═╝
			--    ]]
			local logo = [[
                  ██╗  ██╗██╗   ██╗    ████████╗ █████╗  ██████╗ ██╗                 
                  ██║  ██║██║   ██║    ╚══██╔══╝██╔══██╗██╔═══██╗██║                 
                  ███████║██║   ██║       ██║   ███████║██║   ██║██║                 
                  ██╔══██║██║   ██║       ██║   ██╔══██║██║   ██║╚═╝                 
                  ██║  ██║╚██████╔╝       ██║   ██║  ██║╚██████╔╝██╗                 
                  ╚═╝  ╚═╝ ╚═════╝        ╚═╝   ╚═╝  ╚═╝ ╚═════╝ ╚═╝                 
      ]]

			logo = string.rep("\n", 8) .. logo .. "\n\n"

			local opts = {
				theme = "doom",
				hide = {
					-- this is taken care of by lualine
					-- enabling this messes up the actual laststatus setting after loading a file
					statusline = false,
				},
				config = {
					header = vim.split(logo, "\n"),
          -- stylua: ignore
          center = {
            { action = "Telescope find_files",                                     desc = " Find file",       icon = " ", key = "f" },
            { action = "ene | startinsert",                                        desc = " New file",        icon = " ", key = "n" },
            { action = "Telescope oldfiles",                                       desc = " Recent files",    icon = " ", key = "r" },
            { action = "Telescope live_grep",                                      desc = " Find text",       icon = " ", key = "g" },
            { action = [[lua require("lazyvim.util").telescope.config_files()()]], desc = " Config",          icon = " ", key = "c" },
            { action = 'lua require("persistence").load()',                        desc = " Restore Session", icon = " ", key = "s" },
            { action = "LazyExtras",                                               desc = " Lazy Extras",     icon = " ", key = "x" },
            { action = "Lazy",                                                     desc = " Lazy",            icon = "󰒲 ", key = "l" },
            { action = "qa",                                                       desc = " Quit",            icon = " ", key = "q" },
          },
					footer = function()
						local stats = require("lazy").stats()
						local ms = (math.floor(stats.startuptime * 100 + 0.5) / 100)
						return {
							"🔥 Hu Tao #1! "
								-- .. stats.loaded
								-- .. "/"
								-- .. stats.count
								-- .. " plugins in "
								.. "("
								.. ms
								.. "ms) 🔥",
						}
					end,
				},
			}

			for _, button in ipairs(opts.config.center) do
				button.desc = button.desc .. string.rep(" ", 43 - #button.desc)
				button.key_format = "  %s"
			end

			-- close Lazy and re-open when the dashboard is ready
			if vim.o.filetype == "lazy" then
				vim.cmd.close()
				vim.api.nvim_create_autocmd("User", {
					pattern = "DashboardLoaded",
					callback = function()
						require("lazy").show()
					end,
				})
			end

			return opts
		end,
	},
}
